docs/blog/algorithms/algorithms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Algorithms at CU</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/stylesheets/color-scheme.css"/>
<link rel="stylesheet" type="text/css" href="/stylesheets/layout-blog.css"/>
<link rel="stylesheet" type="text/css" href="/stylesheets/blog-post.css"/>
<link rel="stylesheet" type="text/css" href="/stylesheets/htmlize2.css"/>
</head>
<body>
<div id="preamble" class="status">
<header>
    <nav>
        <a target="_self" href="/">About</a> -
        <a target="_self" href="/blog-posts.html">Blog</a>
        <!-- <a target="_self" href="/portfolio.html">Portfolio</a> -         -->
        <!-- <a target="_self" href="/contact.html">Contact</a> - -->
        <!-- <a target="_self" href="/resume.html">Resume</a> | -->
        <!-- <a target="_blank" rel="noopener noreferrer" href="https://duncan-britt.github.io/splice-docs">Splice</a> - -->
        <!-- <a target="_blank" rel="noopener noreferrer" href="https://word-ladders.herokuapp.com/">Word Ladders</a> -->
        <!-- <a target="_blank" rel="noopener noreferrer" href="https://github.com/Duncan-Britt/">GitHub</a> -
             <a target="_blank" rel="noopener noreferrer" href="https://www.codewars.com/users/Duncan-Britt">Code Wars</a> -->
    </nav>
</header>
</div>
<div id="content" class="content">
<h1 class="title">Algorithms at CU</h1>
<p>This is just a short post in which I mention that I'm taking Algorithms at school right now. I decided to keep a <a href="https://github.com/Duncan-Britt/algorithms/tree/main#Algorithms" target="_blank">Github repository</a>of my implementations of some of the algorithms we are being taught.</p>

<p>
These are the topics covered in the course:
</p>

<ol class="org-ol">
<li>Proof by Induction.</li>
<li>(Greedy) Shortest path algorithms: BFS/DFS.*</li>
<li>(Greedy) Shortest path algorithms: Dijkstra’s Algorithm.*</li>
<li>(Greedy) Examples where greedy algorithms fail.*</li>
<li>(Greedy) Correctness: Exchange Arguments.</li>
<li>(Greedy) Minimum-weight spanning trees: Safe and useless edges.*</li>
<li>(Greedy) Minimum-weight spanning trees: Kruskal’s Algorithm.*</li>
<li>(Greedy) Minimum-weight spanning trees: Prim’s Algorithm.*</li>
<li>(Greedy) Huffman Encoding.</li>
<li>(Greedy) Network flows: terminology.*</li>
<li>(Greedy) Network Flows: Ford–Fulkerson Algorithm.*</li>
<li>Asymptotics: Calculus I Techniques (Polynomials, Polylogarithmic Functions, L’Hopital’s Rule).*</li>
<li>Asymptotics: Calculus II Techniques (Exponentials, Factorials, Quasipolynomials, Ratio and Root Test).*</li>
<li>Analyzing Code I: Independent Nested Loops.*</li>
<li>Analyzing Code II: Dependent Nested Loops.*</li>
<li>Analyzing Code III: Writing Down Recurrences.*</li>
<li>Analyzing Recurrences I: Unrolling.*</li>
<li>(Divide &amp; Conquer) Basics &amp; counterexamples.*</li>
<li>Analyzing Recurrences II: Tree Method.</li>
<li>(Divide &amp; Conquer) Quicksort, Modifications, and Analysis.*</li>
<li>(Dynamic Programming) Identify the precise subproblems.*</li>
<li>(Dynamic Programming) Write Down Recurrences.*</li>
<li>(Dynamic Programming) Using Recurrence to solve.*</li>
<li>(Dynamic Programming) Backtracking to find solutions. †</li>
<li>(Dynamic Programming) Design Dynamic Programming Algorithms.*</li>
<li>(Data Structures) Hash tables, collisions.†</li>
<li>(Data Structures) Doubling lists &amp; their amortized analysis.†</li>
<li>(Computational Complexity) Formulating Decision Problems.†</li>
<li>(Computational Complexity) Showing Problems belong to P.†</li>
<li>(Computational Complexity) Showing Problems belong to NP.†</li>
<li>(Computational Complexity) Structure and Consequences of P vs. NP.</li>
<li>Challenge Standard I</li>
<li>Challenge Standard II</li>
</ol>

<p>
So far (September 28) we've covered the first 10.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-28 Thu 00:00</p>
</div>
</body>
</html>
